In [ ]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [ ]:
titanic = pd.read_csv('/content/Titanic.csv')

In [ ]:
print(titanic.head())

   PassengerId  Survived  Pclass(Ticket class)  \
0            1  Deceased                     3
1            2  Survived                     1
2            3  Survived                     3
3            4  Survived                     1
4            5  Deceased                     3

                                                Name     Sex   Age  \
0                            Braund, Mr. Owen Harris    Male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  Female  38.0
2                             Heikkinen, Miss. Laina  Female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  Female  35.0
4                           Allen, Mr. William Henry    Male  35.0

   SibSp(# of siblings / spouses aboard the Titanic)  \
0                                                  1
1                                                  1
2                                                  0
3                                                  1
4                                                  0

   Parch (# of parents / children aboard the Titanic) Ticket(Ticket number)  \
0                                                  0              A/5 21171
1                                                  0               PC 17599
2                                                  0       STON/O2. 3101282
3                                                  0                 113803
4                                                  0                 373450

      Fare     Embarked
0   7.2500  Southampton
1  71.2833    Cherbourg
2   7.9250  Southampton
3  53.1000  Southampton
4   8.0500  Southampton

In [ ]:
#repalce values in a column
titanic["Sex"] = titanic["Sex"].replace({"male": "Male", "female": "Female"})

   PassengerId  Survived  Pclass(Ticket class)  \
0            1         0                     3
1            2         1                     1
2            3         1                     3
3            4         1                     1
4            5         0                     3

                                                Name     Sex   Age  \
0                            Braund, Mr. Owen Harris    Male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  Female  38.0
2                             Heikkinen, Miss. Laina  Female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  Female  35.0
4                           Allen, Mr. William Henry    Male  35.0

   SibSp(# of siblings / spouses aboard the Titanic)  \
0                                                  1
1                                                  1
2                                                  0
3                                                  1
4                                                  0

   Parch (# of parents / children aboard the Titanic) Ticket(Ticket number)  \
0                                                  0              A/5 21171
1                                                  0               PC 17599
2                                                  0       STON/O2. 3101282
3                                                  0                 113803
4                                                  0                 373450

      Fare Cabin Embarked
0   7.2500   NaN        S
1  71.2833   C85        C
2   7.9250   NaN        S
3  53.1000  C123        S
4   8.0500   NaN        S

In [ ]:
#drop a Column
titanic=titanic.drop(columns=['Cabin'])

In [ ]:
# check null values
print(titanic.isnull().sum())

PassengerId                                           0
Survived                                              0
Pclass(Ticket class)                                  0
Name                                                  0
Sex                                                   0
Age                                                   0
SibSp(# of siblings / spouses aboard the Titanic)     0
Parch (# of parents / children aboard the Titanic)    0
Ticket(Ticket number)                                 0
Fare                                                  0
Embarked                                              0
dtype: int64

In [ ]:
titanic["Survived"]=titanic["Survived"].replace({0:"Deceased",1:"Survived"})

In [ ]:
titanic["Embarked"]=titanic["Embarked"].replace({"S":"Southampton","C":"Cherbourg","Q":"Queenstown"})

In [ ]:
#Mean
mean=titanic["Age"].mean()

In [ ]:
#Fill missing values with mean
titanic["Age"]=titanic['Age'].fillna(mean)

In [ ]:
#Mode
titanic["Embarked"].mode()[0]

'Southampton'

In [ ]:
#Fill missing values with mode
titanic['Embarked']=titanic['Embarked'].fillna(titanic['Embarked'].mode()[0])

In [ ]:
#Upto 1 decimal place
titanic['Age']=titanic["Age"].round(1)

In [ ]:
#save changes to original file
titanic=titanic.to_csv('/content/Titanic.csv', index=False)

In [ ]:
titanic = pd.read_csv('/content/Titanic.csv')
print(titanic.head())

   PassengerId  Survived  Pclass(Ticket class)  \
0            1  Deceased                     3
1            2  Survived                     1
2            3  Survived                     3
3            4  Survived                     1
4            5  Deceased                     3

                                                Name     Sex   Age  \
0                            Braund, Mr. Owen Harris    Male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  Female  38.0
2                             Heikkinen, Miss. Laina  Female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  Female  35.0
4                           Allen, Mr. William Henry    Male  35.0

   SibSp(# of siblings / spouses aboard the Titanic)  \
0                                                  1
1                                                  1
2                                                  0
3                                                  1
4                                                  0

   Parch (# of parents / children aboard the Titanic) Ticket(Ticket number)  \
0                                                  0              A/5 21171
1                                                  0               PC 17599
2                                                  0       STON/O2. 3101282
3                                                  0                 113803
4                                                  0                 373450

      Fare     Embarked
0   7.2500  Southampton
1  71.2833    Cherbourg
2   7.9250  Southampton
3  53.1000  Southampton
4   8.0500  Southampton